Revit 2027 API
LinePattern.SetSegments Method
 Sets the sequence of segments that defines this line pattern.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetSegments(
	IList<LinePatternSegment> lineSegs
)
Public Sub SetSegments (
	lineSegs As IList(Of LinePatternSegment)
)
public:
void SetSegments(
	IList<LinePatternSegment^>^ lineSegs
)
member SetSegments :
        lineSegs : IList<LinePatternSegment> -> unit
Parameters
lineSegs IList<LinePatternSegment>
 The sequence of segments.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
LinePattern Class
Autodesk.Revit.DB Namespace